Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J09A.tmx
Source language: en_us
Languages: zh_cn

source: Quantum optics: Gravity meets quantum physics
zh_cn: 量子光学：当引力遇见量子

source: Quantum physics and gravitational physics remain separate due to the vastly different scales of time and space that they refer to.
zh_cn: 由于分属的时空量级相差得太大，量子物理和引力物理一直保持独立。

source: Now, research may point to links between them.
zh_cn: 如今，研究或许指出了它们之间的一些联系。

source: Albert Einstein's general theory of relativity is a classical formulation but a quantum mechanical description of gravitational forces is needed, not only to investigate the coupling of classical and quantum systems but simply to give a more complete description of our physical surroundings.
zh_cn: 阿尔伯特爱因斯坦的广义相对论是一种经典描述。用量子力学来描述引力，不仅是出于研究经典系统和量子系统之间耦合的需要，也是因为人们就是想得出一个关于我们周遭物理世界的完整描述。

source: As they report in this issue of Nature Photonics, Wen-Te Liao and Sven Ahrens reveal a link between quantum and gravitational physics[1].
zh_cn: 《物理光子学》期刊中，Wen-Te Liao和 Sven Ahrens向我们解释了量子物理和引力物理间的一丝联系[1]。

source: They propose that in the quantum-optical effect of superradiance, the world line of electromagnetic radiation is changed by the presence of a gravitational field.
zh_cn: 他们提出了在超辐射（superradiance）中由于量子光学效应，引力场改变了电磁辐射的世界线（world line）。

source: Superradiance is the effect of collective spontaneous emission from an ensemble of atoms or, here, nuclei that are in a quantum-coherent excited state.
zh_cn: 超辐射是量子相干受激态的的原子团，或原子核团的协同的自发辐射。

source: That excited state is prepared by the absorption of a photon from a pulse of X-rays at an energy corresponding to a transition between nuclear energy levels.
zh_cn: 当原子核团吸收了一个X光脉冲的光子，且光子的能量等于原子核两个能级之间的能量差，那么形成了受激态。

source: When, a little later, a photon is emitted from this ensemble, it will preferentially travel in the direction of the original incident radiation and the time between absorption and emission is, typically, shorter than one would expect based on the excited-state lifetime of a single atom or nucleus.
zh_cn: 稍后，这个原子核团会发射一个光子，它一般来说会向着刚才射入的方向传播。从吸收到发射有一段时间，这段时间比一般单个原子或原子核的受激态待寿命（lifetime）要短。

source: These are characteristic features of superradiance[2] [3].
zh_cn: 这些是超辐射的特征[2, 3] 。

source: As the ensemble absorbs the photon, it stores information about the phase of wavefronts present in the incident electromagnetic field modes.
zh_cn: 当这团粒子吸收了光子，它储存了入射电磁场模式的波阵面相位信息。

source: The excited state is then a quantum-coherent superposition of states, each of which has one atom/nucleus in the excited state, and all others in the ground state.
zh_cn: 此时受激态就成了量子相干的叠加态。这些叠加态中每一个都是一个原子/原子核在受激态，其余在基态。

source: Through emission, the photon is then inserted back into the original mode(s).
zh_cn: 通过发射，光子回到了原来的模式。

source: A classical analogue of this mode-selective emission is with a phased-array antenna, but the same occurs even at the single-photon level.
zh_cn: 用经典物理来做个类比，相位阵天线可以选择发射模式，而这里的单个光子也一样。

source: Constructive interference of these amplitudes leads to directionality and an enhanced emission probability, that is, a faster re-emission.
zh_cn: 这些辐射之间相干相长，就有了方向性，发射的几率也提高了，即更快的重发射（reemission）。

source: This is, in fact, a photon correlation experiment like the one reported by Scully et al.[4]— the incident X-ray pulse is heralded, for example, by microwave photons from the radiofrequency driver of a synchrotron light source, and emission is timed by the detection of the photon.
zh_cn: 这实际上就是类似Scully等人报告[4]的单光子的相关实验。入射的X光脉冲是可预测的（Heralded）。例如，可以用同步加速器光源射频驱动的微波光子，通过探测光子计算发射时间。

source: One may then compare two cases: (1) X-ray photons simply propagate, at the speed of light, from the source to the detector, and (2) a photon is stored in the nuclear-resonant ensemble, and re-created at a later time.
zh_cn: 可以对比这两种情况：（1）x光射线的光子只是从光源到探测其以光速传播；（2）一个光子在谐振原子核团里储存，然后过一阵子后重新被创造。

source: The world lines of these two cases are smooth and kinked, respectively.
zh_cn: 两种情况的世界线一个平滑，一个拐折。

source: What is interesting about this is that the potentially excited nuclei in the ensemble are subjected to slightly different gravitational redshifts, depending on their positions in the ensemble.
zh_cn: 有趣的是，整一团中有可能被激发的原子核，因为它们在粒子团中所处的位置不同，会经历略微不同的引力红移。

source: According to the calculation by Liao and Ahrens[1], this leads to a deflection in the direction of the re- emitted photon that is proportional to the amount of time the photon spends 'in storage'.
zh_cn: 根据Liao和Ahrens的计算[1]，这就使重发射的光子有了一定的偏移，这种偏移和光子被“储存”的时间成正比。

source: The deflection is of similar magnitude as that of a photon that had spent its time 'in flight' in the same gravitational field.
zh_cn: 这种偏移和假设光子在这段时间内受相同引力场作用“飞行”产生的偏移一样大。

source: A photon not undergoing absorption and superradiant re-emission spends less time in the field, and is thus deflected by a correspondingly smaller angle (Fig.1).
zh_cn: 一个光子若没有经过吸收和超辐射的重发射，它待在引力场的时间短些，它的偏移角度就小一些（图一）。

source: For the deflection (a change in the phase gradient of the electromagnetic field) to occur, it is not sufficient for a photon to simply be emitted.
zh_cn: 偏移（电磁场相位变化率的改变）的发生，不仅需要重发射一个光子。

source: Rather, the photon must be recreated in its entirety, including phase information, and this occurs due to the quantum superposition of possible absorption/emission processes in the ensemble.
zh_cn: 更需要的是整个重新创造这个光子，包括它的相位信息，而这是由于原子核团里所有可能的吸收和发射过程的量子叠加。

source: Spontaneous emission is a quantum process, as is the superposition of potentially realized individual processes.
zh_cn: 自发辐射是一个量子过程，是有可能实现的的单一过程的叠加。

source: Being spread out over an ensemble, these processes simultaneously sample the gravitational potential in different places.
zh_cn: 原子核团一定的有空间分布，这些过程在同一时间不同地方感受到了引力势能。

source: Thus, a link between quantum and gravitational physics has been established.
zh_cn: 由此，量子物理和引力物理就联系到了一起。

source: Both of these pillars of modern physics refer to phenomena outside our everyday experience and were discovered only as the investigation of our natural world spread in scope.
zh_cn: 现代物理两大支柱所描述的现象都超越了我们的日常生活经验，只有研究延伸到了我们的自然界，才能够发现这些现象。

source: Gravity is, of course, an everyday experience.
zh_cn: 我们日常当然都能感受到引力。

source: However, the unity of space and time and the distortions of spacetime due to large masses are not.
zh_cn: 然而，时间和空间的统一以及大质量引起的时空扭曲，我们是感受不到的。

source: From our perspective on Earth, these concepts become relevant only when precision instrumentation is used, or when we look far out into the cosmos.
zh_cn: 在地球上，只有我们进行精密测量的时候，或者我们遥望宇宙的时候，这些概念才有意义。

source: Likewise, the discovery of quantum-physical effects a little over a hundred years ago came as a surprise because they become evident only under very subtly defined conditions not common in everyday experience.
zh_cn: 同样的，一百多年前量子物理效应的发现是一个意外。因为只有精巧地定义条件，这种效应才得以体现，平常生活中通常是不会发生的。

source: The first indications that something unexpected was going on came from the photoelectric effect[5] and the spectrum of blackbody radiation[6], [7].
zh_cn: 第一种出乎预料的现 象就是光电效应[5] 以及黑体辐射的光谱[6, 7] 。

source: Nowadays, quantum physics describes phenomena in a wide range of fields: optical (for example, lasers, photonics and so on), electrical (much of solid-state physics, semiconductor technology and so on), chemical (understanding the chemical bonds and reaction-pathway planning), nuclear physics and particle physics, among others.
zh_cn: 如今，量子物理描述的范围很广：光学（比如激光、光电子等等）、电子（固态物理的很多方面、半导体技术等等）、化学（理解化学键和反应进程规划）、核物 理、粒子物理等等。

source: However, it is not a coincidence that it was effects related to electromagnetic radiation that were observed first.
zh_cn: 第一个观察到的量子现象就和电磁场辐射有关，这不是巧合。

source: The study of quantum- physical effects requires very precisely known conditions, that is, quantum coherence.
zh_cn: 研究量子物理效应需要非常精确的条件，即量子相干。

source: When matter is involved in setting up the initial conditions, one then usually has to go to the microscopic world where the degrees of freedom are limited and can be controlled.
zh_cn: 要设置这种初始条件，一般都依赖于自由度有限而可控的微观世界。

source: Light in the visible and adjacent spectral regions is different in that there is almost none in the blackbody spectrum at room temperature (for a well-defined zero), and, given the micrometre wavelength scale, it is relatively easy to control with macroscopic objects, such as gratings for spectral selection.
zh_cn: 可见光及其周边光域很特殊，因为室温下这个范围几乎没有黑体辐射（可以说是零），而且波长在微米量级，因为也比较容易用宏观物体来控制，比如说用光栅作光谱选择。

source: However, to detect a quantum effect, one needs to transition from the microscopic to the macroscopic incoherent world where a dial or, eventually, a journal publication is situated.
zh_cn: 但要探测到量子效应，我们需要把微观世界转换到宏观不相干的世界，一个大到可以放下一个表盘、一本杂志的地 方。

source: Electrons, with their strong Coulomb interaction, can make this transition.
zh_cn: 电子有着很强的库伦作用力，可以用来作这种转换。

source: Thus, the combination of light for setting up the initial conditions (spectral filtering), and electrical measurements for switching to the macroscopic regime was the key to discovering the quantum nature of the photoelectric effect.
zh_cn: 所以说，用光设置起始状态（过滤光谱），用电作测试从而转换到宏观领域，是发现光电效应的量子本质的关键。

source: Midway between the microscopic and cosmic scales is our own world, where our tools for studying science reside.
zh_cn: 在微观和宏观宇宙量级之间的，就是我们这个世界，我们研究科学的工具也在这里。

source: Electromagnetic radiation is probably the most suitable tool to bridge the gap between these scales because it spans cosmic distances within times accessible to human experience.
zh_cn: 电磁辐射在人类可及的时间内可以穿越宇宙间距离，所以它或许最合适被当作跨越这些不同量级的工具。

source: It is therefore no surprise that in the proposal of Liao and Ahrens[1], electromagnetic radiation is the tool of choice.
zh_cn: 因此在Liao和Ahren的提议中[1]，电磁辐射也被他们选择作为工具。

source: Interestingly, the deflection, as expressed by equation (4) in ref. [1], is the same as that given by the Newtonian picture of gravitational deflection over the same amount of time (set the square root in the denominator to ≈1), that is, the ratio of the velocity acquired in free fall over that time, compared with the speed of light.
zh_cn: 有意思的是，在相同时间内，文献[1]中公式（4）描述的偏移和牛顿描述的引力偏移相等（把分母的平方根设为近似于1），即在自由飞行中获得的速度 等于光速。

source: As is well known, general relativity will yield twice as much deflection because, in addition to the free-falling acceleration, there is a nonlocal distortion of spacetime and parallel transport along geodesics leads to more deflection.
zh_cn: 众所周知，广义相对论讲引入两倍的偏移，因为除了自由落地加速度，还有非定域的时空扭曲，平行于测地线的传输引起了更多的偏移。

source: It should be stimulating to discuss whether the deflection of a 'stopped photon' is due to the second effect, leading to the same magnitude as the Newtonian result, but for a different reason.
zh_cn: 讨论一个“静止 的光子”的偏移是否是因为后者引起的，多么激动人心啊，它得出了和牛顿理论相同的结果，却是因为不同的原因。

source: Liao and Ahrens[1] also discuss the case of an accelerated (rotating) ensemble, and the well-known nuclear lighthouse effect[8], that is, the sweeping of the re-emitted beam with the rotation.
zh_cn: Liao和Ahren[1]还讨论了原子核团加速（旋转）的情况，以及大家熟悉的灯塔效应[8] ，即利用旋转让重发射的光束延伸扫描。

source: The proposed experiment, or even the gedanken experiment it is based on, can thus provide some insights into the relationship between quantum and gravitational physics, even if it isn't 'quantum gravity'.
zh_cn: 这里提议的实验，甚至是作为其基础的思想实验（gedanken experiment），虽然还不是“量子引力”，但可以让我们了解一些量子物理和引力物理。

source: One should note, however, that an actual realization of this experiment to measure a very subtle deflection in the Earth's gravitational potential will be seriously challenged by the need to sufficiently suppress all other effects, such as differential time evolution in the ensemble due to stray magnetic fields.
zh_cn: 要注意的是，要真正在这个实验里测试引力势能作用下极小的偏 移，挑战非常大，它需要足够有效地压制对其它所有的效应，比如说原子核团内由于杂散磁场所引起的差异性时间演化。
